import 'package:flutter/material.dart';
import 'package:saa_f/core/themes/text_style.dart';

import '../../core/constant/assets-const.dart';
import '../../core/constant/colors/light-colors.dart';
class AboutPage extends StatelessWidget {
  const AboutPage({super.key});

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: primaryColor,
        appBar: AppBar(
          backgroundColor: Colors.white,
          title: Text("الجمعية الفلكية السورية",style: TextStyle(color: primaryColor),),
        // elevation: 5,
          leading: GestureDetector(
              onTap: (){
                Navigator.pop(context);
              },
              child: Icon(Icons.arrow_back,color: primaryColor,)),
        ),
        body: Container(
          decoration: BoxDecoration(
            // color: Colors.purple
            gradient: LinearGradient(
            colors: [primaryColor,PlightgreenColor], // الألوان التي تريدها في التدرج
            begin: Alignment.topLeft, // بداية التدرج من الزاوية العليا اليسرى
            end: Alignment.bottomRight, // نهاية التدرج في الزاوية السفلية اليمنى
          ),

        ),
          child: SingleChildScrollView(
            child: Padding(
              padding: const EdgeInsets.all(20.0),
              child: Container(
                margin: EdgeInsets.symmetric(
                    horizontal: 8,
                    vertical: 8
                ),
                padding: EdgeInsets.symmetric(
                  vertical: 8,
                  horizontal: 8,
                ),
                decoration: BoxDecoration(
                  borderRadius: BorderRadius.all(Radius.circular(16)),
                  color: Colors.white,
                  boxShadow: [
                    BoxShadow(
                      color: Colors.grey.withOpacity(0.5),
                      spreadRadius: 5,
                      blurRadius: 7,
                      offset: Offset(0, 3), // changes position of shadow
                    ),
                  ],
                ),
                child: Column(
                  children: [
                    Center(child: Image(image: AssetImage(AssetsConst.logo1))),
                    Text("لنستعد أمجادنا في علم الفلك\n",
                    style: TextStyle(
                      fontSize: 30,
                      fontWeight: FontWeight.w900,
                      color: primaryColor
                    ),),
                    Text(
                      "يعتبر علم الفلك من أقدم وأهم العلوم التي عرفها الإنسان، ولا يخفى على أحد أنَّ هذا العلم كان من أكثر المجالات التي التي برع فيها أجدادنا العرب، حيث وصلوا فيه إلى درجة الإبداع."
                          ""
                          "\n\n فإذا نظرناإلى السَّماء في إحدى الليالي الصَّافية لوجدنا أنَّ معظم النُّجوم البارزة تحمل أسماءً عربيةً يتحدث بها الخبراء الأجانب، بينما لا يعلمها إلا نزرٌ يسيرٌ من النَّاس في البلدان العربية "
                          "\n\n كما وأنَّ علم الفلك قد وصل إلى درجة من التَّطور في البلدان الغربية لدرجة أنَّ الفجوة بيننا وبينهم تزداد وتتعاظم كل يوم، حتى أنَّها أصبحت بحجم اتساع هذا الكون الفسيح."
                          "\n\n وقد بلغ الجهل منا مأخذه، حتى أنَّ معظم النَّاس أضحوا لا يعلمون بأنَّ الكواكب تشاهد بالعين المجردة، ويعتقدون أن عدد الأبراج النَّجمية هو اثنا عشر برجاً فقط، ويقتنعون بصحة التنجيم والأبراج وهم بعيدون كل البعد عن معرفة ماهية هذه النجوم، ولذلك.. فقد أصبح من الضروري بذل كل جهدٍ ممكنٍ لتقليص هذه الفجوة، ومحاولة اللحاق بركب العلم في هذا المجال الذي لا نزال بعيدين عنه كل البعد. "
                          "\n\n وقد اجتمعت مجموعةٌ من الشَّباب الطموحين، المحبين للعلم والعمل، والمخلصين لوطنهم ولتاريخهم، والرَّاغبين برفع السَّوية العلمية لشعوبهم بكافة طبقاتها، كل ذلك لاستعادة ما أضعناه من أمجاد، ولإعادة ما فقده علم الفلك من أهميته وهيبته في بلادنا في الوقت الحاضر. "
                          "\n\n تأسست الجمعية الفلكية السورية في مدينة دمشق في يوم الخميس الموافق لـ 19/8/2004 لدى اجتماع السَّادة المؤسسين وهم: المهندس محمد العصيري، الأستاذ عبد السلام الباشا، الأستاذ محمد الكحال، المهندس ألكسندر العادلي، الأستاذ مرهف السعدي، الأستاذ أحمد وسيم الخاني، الدكتور مهند خولاني، الدكتور محمد فراس الصفدي، المهندس محمد صبحي العليوي، الدكتور فواز السيوف، والدكتور فراس مراد."
                          "\n\n وقد كان اسم الجمعية عند تأسيسها «جمعية هواة الفلك السورية». وقد تقرر في هذا الاجتماع تأسيس جمعية علمية تعنى بعلم الفلك وتشمل نشاطاتها كافة الأراضي السُّورية، وتأخذ الجمعية على عاتقها نشر علم الفلك وتطويره بكافة الوسائل الممكنة، وبعد بذل جهودٍ كبيرةٍ تمت الموافقة على الجمعية من قبل وزارة الشُّؤون الاجتماعية والعمل وكافة الجهات المعنية، وتم إشهار الجمعية بتاريخ 31/8/2005."
                          "\n\n وقد كان اسم الجمعية عند تأسيسها «جمعية هواة الفلك السورية». وقد تقرر في هذا الاجتماع تأسيس جمعية علمية تعنى بعلم الفلك وتشمل نشاطاتها كافة الأراضي السُّورية، وتأخذ الجمعية على عاتقها نشر علم الفلك وتطويره بكافة الوسائل الممكنة، وبعد بذل جهودٍ كبيرةٍ تمت الموافقة على الجمعية من قبل وزارة الشُّؤون الاجتماعية والعمل وكافة الجهات المعنية، وتم إشهار الجمعية بتاريخ 31/8/2005."
                          "\n\n وقد تم في بداية عام 2012 تعديل اسم الجمعية بشكلٍ رسمي لتصبح باسم «الجمعية الفلكية السورية»، وذلك وبموجب قرار وزارة الشؤون الاجتماعية والعمل الصادر بتاريخ 18/3/2012، وقد شكل هذا التعديل ضرورة كبيرة للانتقال بعمل الجمعية من مستوى الهواة إلى المستوى الاحترافي، ونظراً لعدم وجود هيئاتٍ رسميةٍ فاعلةٍ في مجال علم الفلك على أراضي الجمهورية العربية السورية، فإنَّ الجمعية قد أخذت على عاتقها هذه المهمة من خلال متابعة الظواهر الفلكية المختلفة ورصدها ونشر علم الفلك على شتى الصعد وإقامة النَّشاطات والفعاليات المختلفة في هذا المجال."
                          "\n\n ولذلك فقد اقتضى ذلك تحولها من جمعية للهواة إلى جمعية للخبراء بالرصد والتَّصوير الفلكي وإقامة النشاطات العلمية على أعلى المستويات."
                          ,

                      style: normalTextStyle(fontSize: 18,fontWeight: FontWeight.w700),
                    ),
                  ],
                ),
              ),
            ),
          ),
        ),
      ),
    );
  }
}
